api/app/Models/ConversationModel.php

    public function getUserConversations(int $userId): array
    {
        return $this->select('conversations.*, u1.name as user_one_name, u1.avatar as user_one_avatar, u2.name as user_two_name, u2.avatar as user_two_avatar')
                    ->join('users u1', 'u1.id = conversations.user_one')
                    ->join('users u2', 'u2.id = conversations.user_two')
                    ->where('user_one', $userId)
                    ->orWhere('user_two', $userId)
                    ->orderBy('updated_at', 'DESC')
                    ->findAll();
---
SELECT `conversations`.*, `u1`.`name` as `user_one_name`, `u1`.`avatar` as `user_one_avatar`, `u2`.`name` as `user_two_name`, `u2`.`avatar` as `user_two_avatar`
FROM `conversations`
JOIN `users` `u1` ON `u1`.`id` = `conversations`.`user_one`
JOIN `users` `u2` ON `u2`.`id` = `conversations`.`user_two`
WHERE `user_one` = 14
OR `user_two` = 14
ORDER BY `updated_at` DESC