api/app/Models/FollowModel.php

    public function follow(int $followerId, int $followedId): bool
    {
        if ($followerId == $followedId) return false;

        // Check if already following
        if ($this->isFollowing($followerId, $followedId)) {
            return true; // Already following
        }

        $data = ['follower_id' => $followerId, 'followed_id' => $followedId];
        return $this->insert($data, true) ? true : false;
---
INSERT INTO `follows` (`follower_id`, `followed_id`, `created_at`) VALUES (91, 52, '2026-04-13 07:56:26')

    public function isFollowing(int $followerId, int $followedId): bool
    {
        return $this->where(['follower_id' => $followerId, 'followed_id' => $followedId])
                    ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `follows`
WHERE `follower_id` = 3
AND `followed_id` = 3

    public function getFollowersCount(int $userId): int
    {
        return $this->where('followed_id', $userId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `follows`
WHERE `followed_id` = 3

    public function getFollowingCount(int $userId): int
    {
        return $this->where('follower_id', $userId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `follows`
WHERE `follower_id` = 3