api/app/Models/LikeModel.php

SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `note_id` = 395
AND `user_id` = 91
---
    public function hasLiked(int $noteId, int $userId): bool
    {
        return $this->where(['note_id' => $noteId, 'user_id' => $userId])->countAllResults() > 0;

SELECT COUNT(*) AS `numrows`
FROM `likes`
WHERE `note_id` = 395
---
    public function getLikeCount(int $noteId): int
    {
        return $this->where('note_id', $noteId)->countAllResults();