api/app/Models/MessageModel.php

    public function getUnreadCount(int $userId): int
    {
        $db = \Config\Database::connect();
        $subQuery = $db->table('conversations')
                       ->select('id')
                       ->where('user_one', $userId)
                       ->orWhere('user_two', $userId)
                       ->getCompiledSelect();
        return $this->where("conversation_id IN ($subQuery)", null, false)
                    ->where('sender_id !=', $userId)
                    ->where('read', 0)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE conversation_id IN (SELECT `id`
FROM `conversations`
WHERE `user_one` = 3
OR `user_two` = 3)
AND `sender_id` != 3
AND `read` = 0