api/app/Models/NoteModel.php

SELECT COUNT(*) AS `numrows`
FROM `notes`
WHERE `user_id` = 14
---
    public function getUserNotes(int $userId, array $filters = [], int $perPage = 10)
    {
        $builder = $this->where('user_id', $userId)->orderBy('updated_at', 'DESC');
        if (!empty($filters['category'])) $builder->where('category', $filters['category']);
        if (!empty($filters['tag'])) {
            $builder->select('notes.*')->join('note_tags', 'note_tags.note_id = notes.id')
                    ->join('tags', 'tags.id = note_tags.tag_id')->where('tags.name', $filters['tag'])
                    ->where('tags.user_id', $userId)->groupBy('notes.id');
        }
        return $builder->paginate($perPage);

SELECT *
FROM `notes`
WHERE `user_id` = 14
ORDER BY `updated_at` DESC
 LIMIT 5
---
    public function getNoteWithTags(int $noteId, int $userId): ?array
    {
        $note = $this->where(['id' => $noteId, 'user_id' => $userId])->first();

SELECT `tags`.`id`, `tags`.`name`
FROM `note_tags`
JOIN `tags` ON `tags`.`id` = `note_tags`.`tag_id`
WHERE `note_tags`.`note_id` = 449
---
    public function getNoteByShareToken(string $token): ?array
    {
        $note = $this->where('share_token', $token)->first();
        if (!$note) return null;
        $db = \Config\Database::connect();
        $tags = $db->table('note_tags')->select('tags.id, tags.name')
                    ->join('tags', 'tags.id = note_tags.tag_id')
                    ->where('note_tags.note_id', $note['id'])->get()->getResultArray();

SELECT *
FROM `notes`
WHERE `user_id` = 3
AND `is_public` = 1
ORDER BY `updated_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `notes`
WHERE `user_id` = 3
AND `is_public` = 1
---
    public function getPublicNotesByUser(int $userId, int $perPage = 10)
    {
        return $this->where(['user_id' => $userId, 'is_public' => 1])
                    ->orderBy('updated_at', 'DESC')->paginate($perPage);

SELECT `followed_id`
FROM `follows`
WHERE `follower_id` = 91
---
    public function getFeed(int $userId, int $perPage = 10)
    {
        $db = \Config\Database::connect();
        $followed = $db->table('follows')->select('followed_id')
                        ->where('follower_id', $userId)->get()->getResultArray();