api/app/Models/NotificationModel.php

    public function getUnreadCount(int $userId): int
    {
        return $this->where('user_id', $userId)->where('read', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 14
AND `read` = 0

    public function getUserNotifications(int $userId, int $limit = 50): array
    {
        return $this->select('notifications.*, users.name as actor_name, users.avatar as actor_avatar')
                    ->join('users', 'users.id = notifications.actor_id')
                    ->where('notifications.user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit($limit)
                    ->findAll();
---
SELECT `notifications`.*, `users`.`name` as `actor_name`, `users`.`avatar` as `actor_avatar`
FROM `notifications`
JOIN `users` ON `users`.`id` = `notifications`.`actor_id`
WHERE `notifications`.`user_id` = 3
ORDER BY `created_at` DESC
 LIMIT 50