api/app/Services/NoteService.php

    public function getUserNotes(int $userId, array $filters = [], int $perPage = 10): array
    {
        $notes = $this->noteModel->getUserNotes($userId, $filters, $perPage);
        $pager = $this->noteModel->pager;
        foreach ($notes as &$note) {
            $note['like_count'] = $this->likeModel->getLikeCount($note['id']);
            $note['comment_count'] = $this->commentModel->where('note_id', $note['id'])->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `note_id` = 30

    public function getNote(int $noteId, int $userId): ?array
    {
        // Try as owner first
        $note = $this->noteModel->getNoteWithTags($noteId, $userId);
        if ($note) {
            $note['like_count'] = $this->likeModel->getLikeCount($noteId);
            $note['comment_count'] = $this->commentModel->where('note_id', $noteId)->countAllResults();
            $note['liked_by_user'] = $this->likeModel->hasLiked($noteId, $userId);
            return $note;
        }

        // Check if public
        $note = $this->noteModel->find($noteId);
        if (!$note || $note['is_public'] != 1) return null;

        // Check if blocked
        if ($this->blockModel->isBlockedEither($userId, $note['user_id'])) return null;

        // Increment views (only for non‑owner)
        $this->noteModel->incrementViews($noteId);

        $note = $this->noteModel->getNoteWithTags($noteId, $note['user_id']);
        $note['like_count'] = $this->likeModel->getLikeCount($noteId);
        $note['comment_count'] = $this->commentModel->where('note_id', $noteId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE `note_id` = 449