api/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `users`.`id` = 14
---
    public function profile()
    {
        $userId = $this->getUserId();
        $model  = new UserModel();
        $user   = $model->find($userId);