api/app/Controllers/ChatController.php

SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `conversation_id` = 1
AND `sender_id` != 14
AND `read` = 0
SELECT *
FROM `messages`
WHERE `conversation_id` = 1
ORDER BY `created_at` DESC
 LIMIT 1
---
    public function conversations()
    {
        $userId = $this->getUserId();
        $convModel = new ConversationModel();
        $convs = $convModel->getUserConversations($userId);

        $messageModel = new MessageModel();
        foreach ($convs as &$conv) {
            $otherId = ($conv['user_one'] == $userId) ? $conv['user_two'] : $conv['user_one'];
            $conv['other_user'] = [
                'id' => $otherId,
                'name' => ($conv['user_one'] == $userId) ? $conv['user_two_name'] : $conv['user_one_name'],
                'avatar' => ($conv['user_one'] == $userId) ? $conv['user_two_avatar'] : $conv['user_one_avatar']
            ];
            $conv['unread_count'] = $messageModel->where('conversation_id', $conv['id'])
                                                 ->where('sender_id !=', $userId)
                                                 ->where('read', 0)
                                                 ->countAllResults();
            $lastMsg = $messageModel->where('conversation_id', $conv['id'])->orderBy('created_at', 'DESC')->first();