api/app/Controllers/DiscoverController.php

SELECT *
FROM `blocked_users`
WHERE `blocked_id` = 91
---
    public function index()
    {
        $userId = $this->getUserId();
        $perPage = (int) ($this->request->getGet('limit') ?? 20);
        $search = $this->request->getGet('search');

        $blockModel = new BlockModel();
        $blockedIds = $blockModel->getBlockedUserIds($userId);
        $blockedBy = $blockModel->where('blocked_id', $userId)->findAll();