api/app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '3'
---
    public function show($id = null)
    {
        $userModel = new UserModel();
        $user = $userModel->find($id);